export default {
    introduce: {
        mainTitle: "AnimationGPT 动作大模型",
        coverTitle: "游戏动作",

        article: "文章",
        abstract: "摘要",

        our: "我们的",
        method: "方法",

        prompt: "提示词",

        examples: [
            "角色双手自然下垂于身体两侧，身体重心稍微下压，向左缓慢移动。",
            "角色轻盈地向前跑动。",
            "角色轻盈地向后转身。",
            "角色轻盈地向前方滑步，过程中隐身，动作迅捷干净利落，流畅连贯，感觉轻飘飘的。",
            "角色轻盈地向前方翻滚，快速地起身。",
            "角色轻盈地向左边翻滚，快速地起身。",
            "角色受击，身体大硬直，均速起身，惊慌失措地身体失衡向后退，右手挥舞在空中。",
            "角色右手持大剑或特大剑，蓄力重击。角色双腿半蹲，上半身微微向右侧侧身，紧接着向前劈砍。最后回到原始站立姿势。",
            "角色右手持大剑或特大剑，未蓄力重击。角色从右侧身向前挥砍。最后回到原始站立姿势。",
            "角色左手持刺剑进行轻击，轻盈地右手挽一个刀花后向前刺击，同时向前碎步，随后恢复站姿。",
            "角色双手各持曲剑和大曲剑，在回旋挥刀后恢复站姿。",
            "角色双手各持曲剑和大曲剑，在回旋挥刀后恢复站姿。",
            "角色右手持太刀，快速奔跑并蓄力，然后使用直截了当的力量感向前刺击，最后恢复站姿。",
            "角色用双持太刀进行战技弹反，沉重地向左侧身蓄力并下蹲，然后右脚前跨同时右手上刺，最后恢复站姿。",
            "角色右手持斧，以跳跃的方式进行攻击。角色跃起，同时落地时右手向前劈砍，然后起身恢复站姿。",
            "角色双持斧头进行轻击，以较迅捷的速度扭腰向右，右腿向前迈步，双手斜向下挥砍。",
            "角色双持戟进行蓄力重击，扎实地侧身扭腰向左，右腿向前迈步，双手共握武器，从左后蓄力，然后向前连续挥两圈。",
            "角色右手持拳套，扎实地直接向前挥击，动作迅捷干净利落。",
            "角色使用曲剑和大曲剑进行战技，扎实的将武器扛在肩膀上，人物向左转身，逆时针旋转一周半，武器顺势挥砍。",
            "角色全身向后被击飞，后仰在地，并缓慢地起身直立。",
            "角色用具有力量感的、沉重、积蓄力量的双手向前用力缓缓推开障碍物。",
            "角色右手握拳，右臂向上挥动两次，左臂向上挥动，右臂向上挥动，右拳举至高处。动作干净利落，较迅捷，带有欢快的氛围。",
            "角色右脚稍向后，双臂在腹部前方拍手数次，动作轻盈、干净利落且较迅捷，欢快流畅连贯。",
            "角色高兴地跳起来，然后右拳向前挥出，动作具有力量感、干净利落且较迅捷，带有不羁、发癫、空翻、杂耍、舞动和欢快的特点。",
            "角色沮丧地双腿张开跪在地上，低头弯腰，动作轻盈而迅捷，但带有一丝沮丧。",
            "角色身体压低，右腿弓步，左腿向前伸直。左手举起身体朝向右侧，挥动到胸前，整体逆时针旋转。旋转180度至面朝左方，左手向后打开，呈马步蹲姿势。然后恢复到蹲下的姿势。",
            "角色使用机关斧，在左手进行蓄力重击。具有力量感的左脚向后撤步，左手向后蓄力。身体转向前方并前倾，左手自左向右挥出，身体随之转动360度后右脚踮脚左脚抬起，高举左手劈下，并朝向右侧的马步落地。恢复站立姿势。",
            "角色双手握着楔丸，高举在头顶，右腿在前左腿在后扎马步，然后向下挥砍。",
            "角色向右转身，扎马步，右手将楔丸插入左手刀鞘中蓄力，然后顺时针转身向前挥。",
            "角色使用不死斩进行双手并用的攻击。扎实地双手持剑从后向前挥，然后将剑插入背后的剑鞘。",
        ],
    },

    demo: {
        title: "动作生成",

        inputLang: "输入语言",
        inputPlaceHolder: "请输入提示词以生成动作...",
        refExample: "参考示例",

        clear: "清除",
        generate: "立即生成",

        download: "下载",

        examples: [
            "角色双手自然下垂于身体两侧，身体重心稍微下压，向左缓慢移动。",
            "角色轻盈地向前跑动。",
            "角色轻盈地向前方翻滚，快速地起身。",
            "角色受击，身体大硬直，均速起身，惊慌失措地身体失衡向后退，右手挥舞在空中。",
            "角色右手持大剑或特大剑，蓄力重击。角色双腿半蹲，上半身微微向右侧侧身，紧接着向前劈砍。最后回到原始站立姿势。",
            "角色双手各持曲剑和大曲剑，在回旋挥刀后恢复站姿。",
            "角色右手持太刀，快速奔跑并蓄力，然后使用直截了当的力量感向前刺击，最后恢复站姿。",
            "角色右手持斧，以跳跃的方式进行攻击。角色跃起，同时落地时右手向前劈砍，然后起身恢复站姿。",
        ],

        supportedWeapon:
            "目前可支持地武器动作模态类型： 匕首/大剑/太刀/曲剑/斧/载/锤/拳头",
    },

    msg: {
        generateSuccess: "生成成功",
        generateError: "生成失败",

        promptIsEmpty: "请输入提示词",
        motionNotGenerated: "动作尚未生成，请先生成",
    },
};
