export default {
    introduce: {
        mainTitle: "AnimationGPT 动作大模型",
        coverTitle: "游戏动作",

        article: "文章",
        abstract: "摘要",

        our: "我们的",
        method: "方法",
        dataset: "数据集",

        prompt: "提示词",

        examples: [
            "角色双手自然下垂于身体两侧，身体重心稍微下压，向左缓慢移动。",
            "角色轻盈地向前跑动。",
            "角色轻盈地向前方滑步，过程中隐身，动作迅捷干净利落，流畅连贯，感觉轻飘飘的。",
            "角色轻盈地向前方翻滚，快速地起身。",
            "角色轻盈地向左边翻滚，快速地起身。",
            "角色受击，身体大硬直，均速起身，惊慌失措地身体失衡向后退，右手挥舞在空中。",
            "角色借助右手初始形态进行单持翻滚攻击，直截了当而有力量感的，双腿半蹲向前跑动的过程中，右手从左向右挥击。",
            "角色右手持大剑或特大剑，蓄力重击。角色双腿半蹲，上半身微微向右侧侧身，紧接着向前劈砍。最后回到原始站立姿势。",
            "角色左手持刺剑进行轻击，轻盈地右手挽一个刀花后向前刺击，同时向前碎步，随后恢复站姿。",
            "角色双手各持曲剑和大曲剑，在回旋挥刀后恢复站姿。",
            "角色右手持太刀，快速奔跑并蓄力，然后使用直截了当的力量感向前刺击，最后恢复站姿。",
            "角色用双持太刀进行战技弹反，沉重地向左侧身蓄力并下蹲，然后右脚前跨同时右手上刺，最后恢复站姿。",
            "角色右手持斧，以跳跃的方式进行攻击。角色跃起，同时落地时右手向前劈砍，然后起身恢复站姿。",
            "角色双持斧头进行轻击，以较迅捷的速度扭腰向右，右腿向前迈步，双手斜向下挥砍。",
            "角色持槌使用战技，具有沉重的力量感，匀速地向左转身旋转一圈，然后顺势将武器砸向地面，最后将武器扛在右肩。",
            "角色双持戟进行蓄力重击，扎实地侧身扭腰向左，右腿向前迈步，双手共握武器，从左后蓄力，然后向前连续挥两圈。",
            "角色使用曲剑和大曲剑进行战技，扎实的将武器扛在肩膀上，人物向左转身，逆时针旋转一周半，武器顺势挥砍。",
            "角色全身向后被击飞，后仰在地，并缓慢地起身直立。",
            "角色向右倾身扭腰，向前快速奔跑，双手稳握刀具，迅速向右上方挥刀。",
            "角色双手握着楔丸，高举在头顶，右腿在前左腿在后扎马步，然后向下挥砍。\t",
        ],
    },

    demo: {
        title: "动作生成",

        inputLang: "输入语言",
        inputPlaceHolder: "请输入提示词以生成动作...",
        refExample: "参考示例",

        clear: "清除",
        generate: "立即生成",

        download: "下载",

        tips: "提示",
        tipsForCNInput: "您输入的提示词语言与您选择的不匹配。这可能导致生成结果错误，您确定要继续吗？",

        tipsForDemoNotOK: "抱歉，Demo 程序现在不可用。",

        examples: [
            "角色双手自然下垂于身体两侧，身体重心稍微下压，向左缓慢移动。",
            "角色轻盈地向前跑动。",
            "角色轻盈地向前方翻滚，快速地起身。",
            "角色受击，身体大硬直，均速起身，惊慌失措地身体失衡向后退，右手挥舞在空中。",
            "角色右手持大剑或特大剑，蓄力重击。角色双腿半蹲，上半身微微向右侧侧身，紧接着向前劈砍。最后回到原始站立姿势。",
            "角色双手各持曲剑和大曲剑，在回旋挥刀后恢复站姿。",
            "角色右手持太刀，快速奔跑并蓄力，然后使用直截了当的力量感向前刺击，最后恢复站姿。",
            "角色右手持斧，以跳跃的方式进行攻击。角色跃起，同时落地时右手向前劈砍，然后起身恢复站姿。",
        ],

        supportedWeapon: "目前可支持地武器动作模态类型： 匕首/大剑/太刀/曲剑/斧/载/锤/拳头",
    },

    msg: {
        generateSuccess: "生成成功",
        generateError: "生成失败",

        promptIsEmpty: "请输入提示词",
        motionNotGenerated: "动作尚未生成，请先生成",
        translateError: "暂时不能使用中文输入，请输入英文",

        notFound: "你找的页面走丢了~",
    },

    btn: {
        yes: "是",
        no: "否",
        back: "返回",
    },
};
